{
  "experiences": [
    {
      "id": 1,
      "company": "CerebralZip",
      "role": "Web Developer",
      "period": "May 2025 - Present",
      "description": [
        "Designed and implemented responsive, user-friendly UI components for the BRAVO C2 app using React.js.",
        "Developed a dynamic case upload system allowing users to upload videos via local file system, DVR integration, or webcam capture.",
        "Implemented a case management interface to list uploaded cases with an interactive thumbnail preview and modal popup functionality for quick content review.",
        "Built a responsive video analytics dashboard with a collapsible left sidebar for object palette and a right sidebar for image preview.",
        "Engineered bounding box detection for objects in video streams with checkbox-controlled timeline highlights, syncing object appearance time to the video player.",
        "Designed a timeline-linked video interaction system: clicking on detected object instances in the timeline dynamically seeks the video to the corresponding timestamp.",
        "Used React.js, Tailwind CSS, and video.js for seamless UI/UX and video rendering capabilities."
      ],
      "technologies": "React.js, Node.js, Typescript, TailwindCSS",
       "projects": [
        {
          "name": "Bravo C2"
        },
        {
          "name": "CerebVision"
        },
        {
          "name": "UnFogg"
        }
      ],
      "projectExplanations": [
        {
          "name": "CerebVision",
          "explanation": "Developed a dynamic case upload system allowing users to upload videos via local file system, DVR integration, or webcam capture. Implemented a case management interface to list uploaded cases with an interactive thumbnail preview and modal popup functionality for quick content review. Built a responsive video analytics dashboard with a collapsible left sidebar for object palette and a right sidebar for image preview. Engineered bounding box detection for objects in video streams with checkbox-controlled timeline highlights, syncing object appearance time to the video player. Designed a timeline-linked video interaction system: clicking on detected object instances in the timeline dynamically seeks the video to the corresponding timestamp. Used React.js, Tailwind CSS, and video.js for seamless UI/UX and video rendering capabilities."
        },
        {
          "name": "UnFogg",
          "explanation": "Developed a responsive analytics dashboard for UnFogg, visualizing real-time audience insights using interactive bar charts and custom UI components. Built the Creative Panel feature where users can generate AI-powered creatives/images based on prompts using Banana AI integration. Implemented seamless user experience across pages with optimized React components, modular UI, and API-driven data flow. Collaborated closely with the product team to translate complex AI outputs into intuitive, user-friendly interfaces."
        }
      ]
    },
    {
      "id": 2,
      "company": "AccelerateBSi",
      "role": "Frontend Developer",
      "period": "June 2024 - May 2025",
      "description": [
        "Built mobile-responsive components using Next.js and Tailwind CSS, enhancing the user interface & design of the project.",
        "Contributed to internal projects by fixing bugs, handling errors, and gaining a deep understanding of project requirements.",
        "Enhanced application reliability and performance through effective problem-solving."
      ],
      "technologies": "React.js, JavaScript, Next.js, Saas, TailwindCSS, Jira",
      "projects": [
        {
          "name": "MyCapsa",
          "url": "https://www.mycapssa.com/"
        },
        {
          "name": "Getivity",
          "url": "https://getivity-dev.com/"
        },
        {
          "name": "Filsuverz",
          "url": "https://www.filsuvez.com/"
        }
      ]
    },
    {
      "id": 2,
      "company": "E-Revbay",
      "role": "Software Developer Intern",
      "period": "May 2023 - September 2023",
      "description": [
        "Business Portal - Business Tracker Platform",
        "Created a portal for performance analysis and target management, boosting operational efficiency by 92% for finance teams.",
        "Architected backend APIs using Node.js, Express, and ExcelJS for Excel file:conditional sheet,data validation and formulas.",
        "API Integration: Integrated APIs for RoleMaster panel to ensure seamless interaction between the frontend and backend.",
        "Payin Payout System - Improving Financial Workflow (Flask, Python, Mysql)",
        "Developed bank and principal name validation logic using fuzzy-string-matching library, got 97% improvement in data accuracy.",
        "Designed robust date picker validation logic and segregated payout data for partner-wise uploads, handling standard and exceptional cases efficiently.",
        "Worked on the Payout part of the system and Implemented invoice generation, email triggers, email logs."
      ],
      "technologies": "React.js, Node.js, Express, Javascript, Mysql"
    },
    {
      "id": 3,
      "company": "CBIA",
      "role": "Application Developer Intern",
      "period": "Jan 2022 - June 2022",
      "description": [
        "Text Analytics Application",
        "Leveraged Azure Cognitive Services Text Analytics API within a C# .NET MVC framework for Analyzing text.",
        "It features Language detection, Sentiment Analysis, Key Phrases, Entity Linking, Named Entity Recognition Functionality.",
        "Crafted an intuitive user interface for seamless text analysis, allowing end-users to input text or analyze PDFs."
      ],
      "technologies": "C# Programming, Asp.net core 5, MVC Architecture, Entity Framework"
    }
  ],
  "techIcons": {
    "React.js": { "icon": "faReact", "color": "#04a3cf" },
    "JavaScript": { "icon": "faJs", "color": "#deaa00" },
    "HTML": { "icon": "faHtml5", "color": "#E34F26" },
    "CSS": { "icon": "faCss3Alt", "color": "#1572B6" },
    "Node.js": { "icon": "faNode", "color": "#339933" },
    "Database": { "icon": "faDatabase", "color": "#336791" },
    "API": { "icon": "faServer", "color": "#4CAF50" },
    "Next.js": { "icon": "faNext", "color": "#000000" },
    "Saas": { "icon": "faSass", "color": "#bf4080" },
    "Jira": { "icon": "faJira", "color": "#0052CC" },
    "C#": { "icon": "faMicrosoft", "color": "#512BD4" },
    "ASP.NET": { "icon": "faMicrosoft", "color": "#512BD4" },
    "MySQL": { "icon": "faMysql", "color": "#4479A1" },
    "Express": { "icon": "faNode", "color": "#000000" },
    "MVC": { "icon": "faCode", "color": "#68217A" },
    "Entity Framework": { "icon": "faDatabase", "color": "#512BD4" },
    "default": { "icon": "faCode", "color": "#6EE7B7" }
  }
}
